import { IQuestionsContent } from "../types/question.types";

export const questions: Array<IQuestionsContent> = [
    {
        question: 'В чем особенность отображения фото?',
        answer: `
            Фотографии в профилях специально показываются другим пользователям заблюрено. Шансы у всех людей равны, и внешность не становится камнем преткновения с первых минут общения. Во время общения в чате, алгоритм приложения предложит поделиться актуальными фото без блюра. При обоюдном согласии фото станут доступны собеседникам.
        `
    },
    {
        question: 'Какое фото добавить в профиль?',
        answer: `
            Добавляйте фото только с собой. Не загружайте фото с друзьями, потому что собеседнику хочется увидеть именно вас, а не ваших друзей или родственников. Фото со спины или прикрытым лицом также не подойдут. Лучшие фото — это портретные снимки с вами.
        `
    },
    {
        question: 'В чем особенность описания профиля?',
        answer: `
            Биография, цели, достижения, интересы все это — играет одну из ключевых ролей. Так как основной задачей является создать симпатию основываясь на внутреннем мире человека, уделяйте этим секциям приложения больше времени.
        `
    },
    {
        question: 'Что добавить в описание профиля?',
        answer: `
            Краткий и содержательный текст, который описывает вас, как человека. Если не получается составить лаконичный текст, то попробуйте сделать список своих качеств или уникальных отличительных черт или увлечений, но при этом соблюдайте этичность.
        `
    },
    {
        question: 'Как мы относямся к оскорблениям и неуважению?',
        answer: `
            Dazzlink категорически не приемлет неуважительного отношения. Профили, на которые пожалуются пользователи за использование ненормативной лексики, откровенных фото, грубых текстов — будут заблокированы.
        `
    },
    {
        question: 'Как разблокировать свой профиль?',
        answer: `
            Единственный способ разблокировать профиль — написать на почту support@dazzlink.asia. После тщательного изучения, команда модераторов свяжется с вами. Если блокировка была выдана безосновательно, ваш профиль будет восстановлен.
        `
    }
]