import { IQuestionsContent } from "../types/question.types";

export const questions: Array<IQuestionsContent> = [
    {
        question: 'В чем особенность отображения фото?',
        answer: `
            Фотографии в профилях отображаются с размытием, чтобы создать равные условия для всех пользователей. Внешность не становится преградой в первые моменты общения. А позже в чате алгоритм приложения предложит поделиться актуальными фото без размытия. И если оба собеседника будут согласны, изображения станут доступны для просмотра.
        `
    },
    {
        question: 'Какое фото добавить в профиль?',
        answer: `
            Загружайте только свои фотографии. Не размещайте снимки с друзьями или родственниками, ведь собеседник хочет увидеть именно вас, а не ваших близких. Фото, на которых вы изображены спиной или с закрытым лицом, также не подойдут. Лучшие фотографии — это портреты, на которых вы хорошо видны.
        `
    },
    {
        question: 'В чем особенность описания профиля?',
        answer: `
            Биография, цели, достижения и интересы – все это играет ключевую роль. Ведь основная задача заключается в том, чтобы вызвать симпатию, опираясь в первую очередь на внутренний мир человека. Поэтому важно уделить больше внимания заполнению этих разделов.
        `
    },
    {
        question: 'Что добавить в описание профиля?',
        answer: `
            Краткое и ёмкое описание себя как личности. Если сложно составить лаконичный текст, попробуйте перечислить свои основные качества, уникальные черты или увлечения, при этом соблюдая этичность.
        `
    },
    {
        question: 'Как мы относимся к оскорблениям и неуважению?',
        answer: `
            Dazzlink категорически не приемлет неуважительного отношения. Профили, на которые пожалуются пользователи за использование ненормативной лексики, откровенных фото, грубых текстов, будут заблокированы.
        `
    },
    {
        question: 'Как разблокировать свой профиль?',
        answer: `
            Единственный способ разблокировать профиль — написать на почту support@dazzlink.asia. После тщательного изучения команда модераторов свяжется с вами. Если блокировка была выдана безосновательно, ваш профиль будет восстановлен.
        `
    }
]